import datetime

diary = {'понедельник': {'утро': ['погулять с собакой'], 'день': [], 'вечер': ['погулять с собакой']},
        'вторник': {'утро': ['погулять с собакой'], 'день': [], 'вечер': ['погулять с собакой']},
        'среда': { 'утро': ['погулять с собакой'], 'день': [], 'вечер': ['погулять с собакой']},
        'четверг': { 'утро': ['погулять с собакой'], 'день': [], 'вечер': ['погулять с собакой']},
        'пятница': { 'утро': ['заехать в шиномонтаж', 'помыть машину'], 'день': [],'вечер': ['поход в театр', 'ужин в кафе']},
        'суббота': { 'утро': [], 'день': [], 'вечер': []},
        'воскресенье': {'утро': [], 'день': [], 'вечер': []}}

del diary['суббота']
del diary['воскресенье']
diary[('суббота', 'воскресенье')] = ['посадить цветы на даче']

diary['вторник']['утро'].append('поход к зубному')

diary['пятница']['вечер'][0] = 'поход в кино'

diary['среда']['утро'].remove('погулять с собакой')
diary['среда']['вечер'].remove('погулять с собакой')
diary['четверг']['утро'].remove('погулять с собакой')
diary['четверг']['вечер'].remove('погулять с собакой')

print(diary['пятница']['утро'][1])

del diary['понедельник']

def getTasks(dayStr):
    global diary
    if dayStr not in diary.keys():
        return "Неверное название дня недели"
    resultStr = ""
    counter = 0

    for k in diary[dayStr].keys():
        taskList = diary[dayStr][k]
        if taskList:
            resultStr += k + ": " + ", ".join(taskList) + ".\n"
            counter += 1

    if counter == 0:
        return "Свободный день"
    return resultStr

print(getTasks('вторник'))

days = {0: 'понедельник',
        1: 'вторник',
        2: 'среда',
        3: 'четверг',
        4: 'пятница',
        5: 'суббота',
        6: 'воскресенье'}
print(getTasks(days[datetime.datetime.today().weekday()]))

def clearDiary():
    diary.clear()
    diary.update(
        {'понедельник': {'утро': [],'день': [],'вечер': []},
            'вторник': {'утро': [],'день': [],'вечер': []},
            'среда': {'утро': [],'день': [],'вечер': []},
            'четверг': {'утро': [],'день': [],'вечер': []},
            'пятница': {'утро': [],'день': [],'вечер': []},
            'суббота': {'утро': [],'день': [],'вечер': []},
            'воскресенье': {'утро': [],'день': [],'вечер': []}})

def addDiary(day, time, todolist):
    splitList = str(todolist).split(', ')
    if (splitList[0] and day and time):
        diary[day][time].append(splitList)
    else:
        return

print('Укажите через пробел дни недели, на которые нужно добавить дела')
days = input().split()